# MySQL Workbench Queries (Core)
- Sherlin Whaley

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [2]:
import json
with open('/Users/sherlin01/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/world"
engine = create_engine(connection)

In [4]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [5]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

  Tables_in_world
0          cities
1       countries
2       languages

In [22]:
q = '''SELECT * FROM cities
        LIMIT 2;'''
pd.read_sql(q,engine)

   id      name country_code  district  population  country_id
0   1     Kabul          AFG     Kabol     1780000           2
1   2  Qandahar          AFG  Qandahar      237500           2

In [23]:
q = '''SELECT * FROM countries
        LIMIT 2;'''
pd.read_sql(q,engine)

,id,code,name,continent,region,surface_area,indep_year,population,life_expectancy,gnp,gnp_old,local_name,government_form,head_of_state,capital,code2
0,1,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129,AW
1,2,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1,AF

In [24]:
q = '''SELECT * FROM languages
        LIMIT 2;'''
pd.read_sql(q,engine)

   id country_code language is_official  percentage  country_id
0   1          ABW    Dutch           T         5.3           1
1   2          ABW  English           F         9.5           1

1. What query would you run to summarize the number of countries in each continent? The query should display the name of the continent and the number of countries. Also, the query should arrange the result by the number of countries in descending order.

In [6]:
q = '''SELECT countries.continent, COUNT(countries.id) AS num_countries
        FROM countries
        GROUP BY countries.continent
        ORDER BY num_countries DESC;'''
pd.read_sql(q,engine)

       continent  num_countries
0         Africa             58
1           Asia             51
2         Europe             46
3  North America             37
4        Oceania             28
5  South America             14
6     Antarctica              5

2. What query would you run to get all the countries that speak Greek? Your query should return the name of the country, language, and language percentage. Your query should arrange the result by language percentage in descending order.

In [8]:
q = '''SELECT countries.name, languages.language, languages.percentage
        FROM countries
        JOIN languages ON countries.id = languages.country_id
        WHERE languages.language = 'Greek'
        ORDER BY languages.percentage DESC;'''
pd.read_sql(q,engine)

        name language  percentage
0     Greece    Greek        98.5
1     Cyprus    Greek        74.1
2    Albania    Greek         1.8
3  Australia    Greek         1.6
4    Germany    Greek         0.4

3.​ What query would you run to get all the countries with Surface Area less than 1000 OR a population greater than 100,0000,000? Include the country name, surface area, and population in your results.

In [9]:
q = '''SELECT countries.name, countries.surface_area, countries.population
        FROM countries
        WHERE countries.surface_area < 1000 OR countries.population > 100000000;'''
pd.read_sql(q,engine)

                                name  surface_area  population
0                              Aruba         193.0      103000
1                           Anguilla          96.0        8000
2                            Andorra         468.0       78000
3               Netherlands Antilles         800.0      217000
4                     American Samoa         199.0       68000
..                               ...           ...         ...
59     Holy See (Vatican City State)           0.4        1000
60  Saint Vincent and the Grenadines         388.0      114000
61           Virgin Islands, British         151.0       21000
62              Virgin Islands, U.S.         347.0       93000
63                 Wallis and Futuna         200.0       15000

[64 rows x 3 columns]

4. What query would you run to get countries with a government form of “Federal Republic” with a life expectancy of less than 75 years?  Include the country name, form of government, and life expectancy in the results.

In [10]:
q = '''SELECT countries.name, countries.government_form, countries.life_expectancy
        FROM countries
        WHERE countries.government_form = 'Federal Republic'
        AND countries.life_expectancy < 75;'''
pd.read_sql(q,engine)

                               name   government_form  life_expectancy
0                        Azerbaijan  Federal Republic             62.9
1            Bosnia and Herzegovina  Federal Republic             71.5
2                            Brazil  Federal Republic             62.9
3   Micronesia, Federated States of  Federal Republic             68.6
4                             India  Federal Republic             62.5
5                        Madagascar  Federal Republic             55.0
6                            Mexico  Federal Republic             71.5
7                           Nigeria  Federal Republic             51.6
8                Russian Federation  Federal Republic             67.2
9                         Venezuela  Federal Republic             73.1
10                       Yugoslavia  Federal Republic             72.4

5. What query would you run to get all the cities of Mexico inside the Veracruz district and have a population greater than 100,000? The query should return the Country Name, City Name, District, and Population.

In [12]:
q = '''SELECT countries.name, cities.name, cities.district, cities.population
        FROM countries
        JOIN cities ON cities.country_id = countries.id
        WHERE countries.name = 'Mexico'
        AND cities.district = 'Veracruz'
        AND cities.population > 100000;'''
pd.read_sql(q,engine)

      name                   name  district  population
0   Mexico               Veracruz  Veracruz      457119
1   Mexico                 Xalapa  Veracruz      390058
2   Mexico          Coatzacoalcos  Veracruz      267037
3   Mexico               CÃ³rdoba  Veracruz      176952
4   Mexico               Papantla  Veracruz      170123
5   Mexico            MinatitlÃ¡n  Veracruz      152983
6   Mexico   Poza Rica de Hidalgo  Veracruz      152678
7   Mexico     San AndrÃ©s Tuxtla  Veracruz      142251
8   Mexico                TÃºxpam  Veracruz      126475
9   Mexico  MartÃ­nez de la Torre  Veracruz      118815
10  Mexico                Orizaba  Veracruz      118488
11  Mexico              Temapache  Veracruz      102824

​6. What query would you run to get all the ten cities in Brazil with the smallest population? Your query should include the country name, city name, and population. Arrange the result by population in ascending order. Limit the result to the 10 cities with the smallest population.

In [13]:
q = '''SELECT countries.name, cities.name, cities.population
        FROM countries
        JOIN cities ON cities.country_id = countries.id
        WHERE countries.name = 'Brazil'
        ORDER BY cities.population 
        LIMIT 10;'''
pd.read_sql(q,engine)

     name                     name  population
0  Brazil  Ãguas Lindas de GoiÃ¡s       89200
1  Brazil                     PoÃ¡       89236
2  Brazil         Bento GonÃ§alves       89254
3  Brazil          Barra do PiraÃ­       89388
4  Brazil                 PalhoÃ§a       89465
5  Brazil                 CorumbÃ¡       90111
6  Brazil                Ituiutaba       90507
7  Brazil                    Patos       90519
8  Brazil              Campo Largo       91203
9  Brazil               Votorantim       91777

​7. What query would you run to get all languages spoken greater than 10% in Monaco? Display the country name, language, and percentage.

In [14]:
q = '''SELECT countries.name, languages.language, languages.percentage
        FROM countries
        JOIN languages ON languages.country_id = countries.id
        WHERE countries.name = 'Monaco'
        AND languages.percentage > 10;'''
pd.read_sql(q,engine)

     name    language  percentage
0  Monaco      French        41.9
1  Monaco     Italian        16.1
2  Monaco  Monegasque        16.1